/**
 * @fileoverview
 * @email zhangshen04@baidu.com
 *        shanli@baidu.com
 */

define('merchant:common:msg', function () {

    'use strict';

    return {
        defaultMsg : '啊哦…我好像出错了！',
        zhida: {
            500: '啊哦…我好像出错了！',
            400: '您还没有登录',
            90:  '请先发送验证码',
            91:  '验证码不正确',   
            100: '请提供需要修改的APP_ID',
            101: '创建应用发生错误',
            102: '啊哦…我好像出错了！',
            103: '您没有应用访问权限',
            104: '审核中无法修改',
            110: '直达号还没有上线哦',
            111: '啊哦…我好像出错了！',
            112: '授权用户无法修改站点',
            301: '该直达站点已经上线',
            303: '站点所有权验证失败',
            304: '站点提交过不能暂存',
            305: '站点下线验证码有误'
        },
        crm: {
            157110: '分组名称重复',
            157113: '分组数量超出上限'
        },
        deal: {
            1001000: "请求成功",
            1001003: "缺少必要的参数",
            1001004: "参数不合法",
            1001005: "网络连接失败",
            1001008: "登录账户过期，请重新登录",
            1001010: "没有权限，请联系管理员开通权限或重新登录",
            1001011: "您查询的条件下没有数据",
            1002101: "无权查看当前数据",
            1002102: "无权查看当前数据",
            1002103: "无权查看当前数据",
            1002104: "网络繁忙，请稍后重试",
            1002105: "生成支付码失败，请刷新当前页面",
            1002106: "转出失败，请重新提交转出申请",
            1002107: "商户结算配置错误不允许转出",
            1002108: "订单状态错误",
            1002109: "查询商户资质信息失败"
        }
    }
});